# XCenter

## Description
_Vectorworks 2012 Deprecated Functions__Vectorworks 2012 Deprecated Functions_. See XCenterN for a replacement function.

Returns the x-coordinate of the center point of an object matching the serach criteria. If more than one object matches the search criteria, the function will return the sum of the coordinates of all the matching objects.

```pascal
FUNCTION XCenter(c : CRITERIA): REAL;
```

```python
def vs.XCenter(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|Search criteria.|

## Examples
#### VectorScript ####
```pascal
XCenValue:=XCenter(N='Board');
{returns the x-coord of the center of the named object 'Board'}
```
#### Python ####
```python

```

```pascal
resultVal := XCenter(c);
```
```python
result = vs.XCenter(c)
```

## Version
Availability: from All Versions
Deprecated: Vectorworks 2012 Deprecated Functions

## Category
* Criteria